Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_OFF (11u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_LEN (4u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_MSK (0xfu)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_OFF (12u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_OFF (20u)

/** \brief Length for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_LEN (13u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_MSK (0x1fffu)

/** \brief Offset for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_LEN (13u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_MSK (0x1fffu)

/** \brief Offset for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_LEN (10u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_MSK (0x3ffu)

/** \brief Offset for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_OUT_H_OFFS_Bits.ISP_OUT_H_OFFS */
#define IFX_CIF_ISP_OUT_H_OFFS_ISP_OUT_H_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_ISP_OUT_H_OFFS_Bits.ISP_OUT_H_OFFS */
#define IFX_CIF_ISP_OUT_H_OFFS_ISP_OUT_H_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISP_OUT_H_OFFS_Bits.ISP_OUT_H_OFFS */
#define IFX_CIF_ISP_OUT_H_OFFS_ISP_OUT_H_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_OUT_H_SIZE_Bits.ISP_OUT_H_SIZE */
#define IFX_CIF_ISP_OUT_H_SIZE_ISP_OUT_H_SIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_ISP_OUT_H_SIZE_Bits.ISP_OUT_H_SIZE */
#define IFX_CIF_ISP_OUT_H_SIZE_ISP_OUT_H_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISP_OUT_H_SIZE_Bits.ISP_OUT_H_SIZE */
#define IFX_CIF_ISP_OUT_H_SIZE_ISP_OUT_H_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_OUT_V_SIZE_Bits.ISP_OUT_V_SIZE */
#define IFX_CIF_ISP_OUT_V_SIZE_ISP_OUT_V_SIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_ISP_OUT_V_SIZE_Bits.ISP_OUT_V_SIZE */
#define IFX_CIF_ISP_OUT_V_SIZE_ISP_OUT_V_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISP_OUT_V_SIZE_Bits.ISP_OUT_V_SIZE */
#define IFX_CIF_ISP_OUT_V_SIZE_ISP_OUT_V_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_ENABLE_SHD_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_ENABLE_SHD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_ENABLE_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_INFORM_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_INFORM_ENABLE_SHD_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_INFORM_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_INFORM_ENABLE_SHD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_INFORM_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_INFORM_ENABLE_SHD_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.INFORM_FIELD */
#define IFX_CIF_ISP_FLAGS_SHD_INFORM_FIELD_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.INFORM_FIELD */
#define IFX_CIF_ISP_FLAGS_SHD_INFORM_FIELD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.INFORM_FIELD */
#define IFX_CIF_ISP_FLAGS_SHD_INFORM_FIELD_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_DATA */
#define IFX_CIF_ISP_FLAGS_SHD_S_DATA_LEN (16u)

/** \brief Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_DATA */
#define IFX_CIF_ISP_FLAGS_SHD_S_DATA_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_DATA */
#define IFX_CIF_ISP_FLAGS_SHD_S_DATA_OFF (14u)

/** \brief Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_VSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_VSYNC_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_VSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_VSYNC_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_VSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_VSYNC_OFF (30u)

/** \brief Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_HSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_HSYNC_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_HSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_HSYNC_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_HSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_HSYNC_OFF (31u)

/** \brief Length for Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits.ISP_OUT_H_OFFS_SHD */
#define IFX_CIF_ISP_OUT_H_OFFS_SHD_ISP_OUT_H_OFFS_SHD_LEN (12u)

