Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME_IN */
#define IFX_CIF_ISP_ISR_ISR_FRAME_IN_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME_IN */
#define IFX_CIF_ISP_ISR_ISR_FRAME_IN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME_IN */
#define IFX_CIF_ISP_ISR_ISR_FRAME_IN_OFF (5u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_V_START */
#define IFX_CIF_ISP_ISR_ISR_V_START_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_V_START */
#define IFX_CIF_ISP_ISR_ISR_V_START_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_V_START */
#define IFX_CIF_ISP_ISR_ISR_V_START_OFF (6u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_H_START */
#define IFX_CIF_ISP_ISR_ISR_H_START_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_H_START */
#define IFX_CIF_ISP_ISR_ISR_H_START_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_H_START */
#define IFX_CIF_ISP_ISR_ISR_H_START_OFF (7u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_WD_TRIG */
#define IFX_CIF_ISP_ISR_ISR_WD_TRIG_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_WD_TRIG */
#define IFX_CIF_ISP_ISR_ISR_WD_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_WD_TRIG */
#define IFX_CIF_ISP_ISR_ISR_WD_TRIG_OFF (19u)

/** \brief Length for Ifx_CIF_ISP_ERR_Bits.INFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_INFORM_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ERR_Bits.INFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_INFORM_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ERR_Bits.INFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_INFORM_SIZE_ERR_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ERR_Bits.IS_SIZE_ERR */
#define IFX_CIF_ISP_ERR_IS_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ERR_Bits.IS_SIZE_ERR */
#define IFX_CIF_ISP_ERR_IS_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ERR_Bits.IS_SIZE_ERR */
#define IFX_CIF_ISP_ERR_IS_SIZE_ERR_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_ERR_Bits.OUTFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_OUTFORM_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ERR_Bits.OUTFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_OUTFORM_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ERR_Bits.OUTFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_OUTFORM_SIZE_ERR_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_ERR_CLR_Bits.INFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_INFORM_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ERR_CLR_Bits.INFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_INFORM_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ERR_CLR_Bits.INFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_INFORM_SIZE_ERR_CLR_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ERR_CLR_Bits.IS_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_IS_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ERR_CLR_Bits.IS_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_IS_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ERR_CLR_Bits.IS_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_IS_SIZE_ERR_CLR_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_ERR_CLR_Bits.OUTFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_OUTFORM_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ERR_CLR_Bits.OUTFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_OUTFORM_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ERR_CLR_Bits.OUTFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_OUTFORM_SIZE_ERR_CLR_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_FRAME_COUNT_Bits.FRAME_COUNTER */
#define IFX_CIF_ISP_FRAME_COUNT_FRAME_COUNTER_LEN (10u)

/** \brief Mask for Ifx_CIF_ISP_FRAME_COUNT_Bits.FRAME_COUNTER */
#define IFX_CIF_ISP_FRAME_COUNT_FRAME_COUNTER_MSK (0x3ffu)

/** \brief Offset for Ifx_CIF_ISP_FRAME_COUNT_Bits.FRAME_COUNTER */
#define IFX_CIF_ISP_FRAME_COUNT_FRAME_COUNTER_OFF (0u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_OFF (0u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_OFF (3u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_OFF (7u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_OFF (16u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_OFF (18u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_OFF (20u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_OFF (21u)

/** \brief Length for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_OFF (22u)

/** \brief Length for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_MSK (0x1u)

