Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Mask for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_ENC_VSIZE_Bits.ENC_VSIZE */
#define IFX_CIF_JPE_ENC_VSIZE_ENC_VSIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_JPE_ENC_VSIZE_Bits.ENC_VSIZE */
#define IFX_CIF_JPE_ENC_VSIZE_ENC_VSIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_JPE_ENC_VSIZE_Bits.ENC_VSIZE */
#define IFX_CIF_JPE_ENC_VSIZE_ENC_VSIZE_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_LEN (3u)

/** \brief Mask for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_MSK (0x7u)

/** \brief Offset for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_LEN (16u)

/** \brief Mask for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_LEN (2u)

/** \brief Mask for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_MSK (0x3u)

/** \brief Offset for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TQ_U_SELECT_Bits.TQ1_SELECT */
#define IFX_CIF_JPE_TQ_U_SELECT_TQ1_SELECT_LEN (2u)

/** \brief Mask for Ifx_CIF_JPE_TQ_U_SELECT_Bits.TQ1_SELECT */
#define IFX_CIF_JPE_TQ_U_SELECT_TQ1_SELECT_MSK (0x3u)

/** \brief Offset for Ifx_CIF_JPE_TQ_U_SELECT_Bits.TQ1_SELECT */
#define IFX_CIF_JPE_TQ_U_SELECT_TQ1_SELECT_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TQ_V_SELECT_Bits.TQ2_SELECT */
#define IFX_CIF_JPE_TQ_V_SELECT_TQ2_SELECT_LEN (2u)

/** \brief Mask for Ifx_CIF_JPE_TQ_V_SELECT_Bits.TQ2_SELECT */
#define IFX_CIF_JPE_TQ_V_SELECT_TQ2_SELECT_MSK (0x3u)

/** \brief Offset for Ifx_CIF_JPE_TQ_V_SELECT_Bits.TQ2_SELECT */
#define IFX_CIF_JPE_TQ_V_SELECT_TQ2_SELECT_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S0 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S0_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S0 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S0_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S0 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S0_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S1 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S1_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S1 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S1_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S1 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S1_OFF (1u)

/** \brief Length for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S2 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S2_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S2 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S2_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DC_TABLE_SELECT_Bits.S2 */
#define IFX_CIF_JPE_DC_TABLE_SELECT_S2_OFF (2u)

/** \brief Length for Ifx_CIF_JPE_AC_TABLE_SELECT_Bits.AC_TABLE_SELECT */
#define IFX_CIF_JPE_AC_TABLE_SELECT_AC_TABLE_SELECT_LEN (3u)

/** \brief Mask for Ifx_CIF_JPE_AC_TABLE_SELECT_Bits.AC_TABLE_SELECT */
#define IFX_CIF_JPE_AC_TABLE_SELECT_AC_TABLE_SELECT_MSK (0x7u)

/** \brief Offset for Ifx_CIF_JPE_AC_TABLE_SELECT_Bits.AC_TABLE_SELECT */
#define IFX_CIF_JPE_AC_TABLE_SELECT_AC_TABLE_SELECT_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_L */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_L_LEN (8u)

/** \brief Mask for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_L */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_L_MSK (0xffu)

/** \brief Offset for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_L */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_L_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_H */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_H_LEN (8u)

/** \brief Mask for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_H */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_H_MSK (0xffu)

/** \brief Offset for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_H */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_H_OFF (8u)

/** \brief Length for Ifx_CIF_JPE_TABLE_ID_Bits.TABLE_ID */
#define IFX_CIF_JPE_TABLE_ID_TABLE_ID_LEN (4u)

/** \brief Mask for Ifx_CIF_JPE_TABLE_ID_Bits.TABLE_ID */
#define IFX_CIF_JPE_TABLE_ID_TABLE_ID_MSK (0xfu)

/** \brief Offset for Ifx_CIF_JPE_TABLE_ID_Bits.TABLE_ID */
#define IFX_CIF_JPE_TABLE_ID_TABLE_ID_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TAC0_LEN_Bits.TAC0_LEN */
#define IFX_CIF_JPE_TAC0_LEN_TAC0_LEN_LEN (8u)

/** \brief Mask for Ifx_CIF_JPE_TAC0_LEN_Bits.TAC0_LEN */
#define IFX_CIF_JPE_TAC0_LEN_TAC0_LEN_MSK (0xffu)

/** \brief Offset for Ifx_CIF_JPE_TAC0_LEN_Bits.TAC0_LEN */
#define IFX_CIF_JPE_TAC0_LEN_TAC0_LEN_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TDC0_LEN_Bits.TDC0_LEN */
#define IFX_CIF_JPE_TDC0_LEN_TDC0_LEN_LEN (8u)

/** \brief Mask for Ifx_CIF_JPE_TDC0_LEN_Bits.TDC0_LEN */
#define IFX_CIF_JPE_TDC0_LEN_TDC0_LEN_MSK (0xffu)

/** \brief Offset for Ifx_CIF_JPE_TDC0_LEN_Bits.TDC0_LEN */
#define IFX_CIF_JPE_TDC0_LEN_TDC0_LEN_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TAC1_LEN_Bits.TAC1_LEN */
#define IFX_CIF_JPE_TAC1_LEN_TAC1_LEN_LEN (8u)

/** \brief Mask for Ifx_CIF_JPE_TAC1_LEN_Bits.TAC1_LEN */
#define IFX_CIF_JPE_TAC1_LEN_TAC1_LEN_MSK (0xffu)

/** \brief Offset for Ifx_CIF_JPE_TAC1_LEN_Bits.TAC1_LEN */
#define IFX_CIF_JPE_TAC1_LEN_TAC1_LEN_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TDC1_LEN_Bits.TDC1_LEN */
#define IFX_CIF_JPE_TDC1_LEN_TDC1_LEN_LEN (8u)

/** \brief Mask for Ifx_CIF_JPE_TDC1_LEN_Bits.TDC1_LEN */
#define IFX_CIF_JPE_TDC1_LEN_TDC1_LEN_MSK (0xffu)

/** \brief Offset for Ifx_CIF_JPE_TDC1_LEN_Bits.TDC1_LEN */
#define IFX_CIF_JPE_TDC1_LEN_TDC1_LEN_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_ENCODER_BUSY_Bits.CODEC_BUSY */
#define IFX_CIF_JPE_ENCODER_BUSY_CODEC_BUSY_LEN (1u)

