Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Mask for Ifx_CIF_JPE_ENCODER_BUSY_Bits.CODEC_BUSY */
#define IFX_CIF_JPE_ENCODER_BUSY_CODEC_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ENCODER_BUSY_Bits.CODEC_BUSY */
#define IFX_CIF_JPE_ENCODER_BUSY_CODEC_BUSY_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_LEN (2u)

/** \brief Mask for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_MSK (0x3u)

/** \brief Offset for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_ENCODE_MODE_Bits.ENCODE_MODE */
#define IFX_CIF_JPE_ENCODE_MODE_ENCODE_MODE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ENCODE_MODE_Bits.ENCODE_MODE */
#define IFX_CIF_JPE_ENCODE_MODE_ENCODE_MODE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ENCODE_MODE_Bits.ENCODE_MODE */
#define IFX_CIF_JPE_ENCODE_MODE_ENCODE_MODE_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_QIQ_TABLE_ACC */
#define IFX_CIF_JPE_DEBUG_DEB_QIQ_TABLE_ACC_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_QIQ_TABLE_ACC */
#define IFX_CIF_JPE_DEBUG_DEB_QIQ_TABLE_ACC_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_QIQ_TABLE_ACC */
#define IFX_CIF_JPE_DEBUG_DEB_QIQ_TABLE_ACC_OFF (2u)

/** \brief Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_ENCODE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_ENCODE_BUSY_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_ENCODE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_ENCODE_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_ENCODE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_ENCODE_BUSY_OFF (3u)

/** \brief Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_R2B_MEMORY_FULL */
#define IFX_CIF_JPE_DEBUG_DEB_R2B_MEMORY_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_R2B_MEMORY_FULL */
#define IFX_CIF_JPE_DEBUG_DEB_R2B_MEMORY_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_R2B_MEMORY_FULL */
#define IFX_CIF_JPE_DEBUG_DEB_R2B_MEMORY_FULL_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_OFF (5u)

/** \brief Length for Ifx_CIF_JPE_DEBUG_Bits.DEB_BAD_TABLE_ACCESS */
#define IFX_CIF_JPE_DEBUG_DEB_BAD_TABLE_ACCESS_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_DEBUG_Bits.DEB_BAD_TABLE_ACCESS */
#define IFX_CIF_JPE_DEBUG_DEB_BAD_TABLE_ACCESS_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_BAD_TABLE_ACCESS */
#define IFX_CIF_JPE_DEBUG_DEB_BAD_TABLE_ACCESS_OFF (8u)

/** \brief Length for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_SYMBOL_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_SYMBOL_ERR_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_ERROR_IMR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_IMR_DCT_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_IMR_DCT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_IMR_DCT_ERR_OFF (7u)

/** \brief Length for Ifx_CIF_JPE_ERROR_IMR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief Length for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_TABLE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_TABLE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_TABLE_ERR_OFF (10u)

/** \brief Length for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_OFF (7u)

/** \brief Length for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief Length for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_OFF (10u)

/** \brief Length for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_SYMBOL_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_SYMBOL_ERR_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_ERROR_MIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_MIS_DCT_ERR_LEN (1u)

