Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_MIS_DCT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_MIS_DCT_ERR_OFF (7u)

/** \brief Length for Ifx_CIF_JPE_ERROR_MIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief Length for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_OFF (10u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_SYMBOL_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_SYMBOL_ERR_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ICR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ICR_DCT_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ICR_DCT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ICR_DCT_ERR_OFF (7u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ICR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_TABLE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_TABLE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_TABLE_ERR_OFF (10u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_SYMBOL_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_SYMBOL_ERR_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ISR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ISR_DCT_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ISR_DCT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ISR_DCT_ERR_OFF (7u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ISR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief Length for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_TABLE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_TABLE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_TABLE_ERR_OFF (10u)

/** \brief Length for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_OFF (5u)

/** \brief Length for Ifx_CIF_JPE_STATUS_RIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_RIS_ENCODE_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_RIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_RIS_ENCODE_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_RIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_RIS_ENCODE_DONE_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_STATUS_RIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_RIS_GEN_HEADER_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_RIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_RIS_GEN_HEADER_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_RIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_RIS_GEN_HEADER_DONE_OFF (5u)

/** \brief Length for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_OFF (5u)

/** \brief Length for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_MSK (0x1u)

