Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Mask for Ifx_CIF_EP_IC_1S_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_1S_H_SIZE_H_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_1S_H_SIZE_H_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_1S_V_SIZE_V_SIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_1S_V_SIZE_V_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_1S_V_SIZE_V_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_1S_MAX_DX_MAX_DX_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_1S_MAX_DX_MAX_DX_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_1S_MAX_DX_MAX_DX_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_1S_MAX_DY_MAX_DY_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_1S_MAX_DY_MAX_DY_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_1S_MAX_DY_MAX_DY_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_1S_DISPLACE_DX_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_1S_DISPLACE_DX_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_1S_DISPLACE_DX_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_1S_DISPLACE_DY_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_1S_DISPLACE_DY_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_1S_DISPLACE_DY_OFF (16u)

/** \brief Length for Ifx_CIF_EP_IC_1S_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_1S_H_OFFS_SHD_H_OFFS_SHD_LEN (13u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_1S_H_OFFS_SHD_H_OFFS_SHD_MSK (0x1fffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_1S_H_OFFS_SHD_H_OFFS_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_1S_V_OFFS_SHD_V_OFFS_SHD_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_1S_V_OFFS_SHD_V_OFFS_SHD_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_1S_V_OFFS_SHD_V_OFFS_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_1S_H_SIZE_SHD_H_SIZE_SHD_LEN (13u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_1S_H_SIZE_SHD_H_SIZE_SHD_MSK (0x1fffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_1S_H_SIZE_SHD_H_SIZE_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_1S_V_SIZE_SHD_V_SIZE_SHD_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_1S_V_SIZE_SHD_V_SIZE_SHD_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_1S_V_SIZE_SHD_V_SIZE_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_OFF (1u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_OFF (3u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_OFF (4u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_OFF (5u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_OFF (17u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_OFF (18u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_OFF (19u)

