Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_bf.h
/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_OFF (20u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_OFF (21u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_OFF (1u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_OFF (3u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_OFF (4u)

/** \brief Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_OFF (5u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_1_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_1_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_1_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_1_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_1_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_1_OFF (1u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_1_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_1_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_1_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_IMSC_MBLK_LINE_EP_1_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_IMSC_MBLK_LINE_EP_1_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_IMSC_MBLK_LINE_EP_1_OFF (3u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_2_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_2_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_2_OFF (4u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_2_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_2_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_2_OFF (5u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_2_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_2_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_2_OFF (6u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_IMSC_MBLK_LINE_EP_2_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_IMSC_MBLK_LINE_EP_2_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_IMSC_MBLK_LINE_EP_2_OFF (7u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_3_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_3_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_IMSC_FRAME_END_EP_3_OFF (8u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_3_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_3_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_IMSC_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_IMSC_FILL_EP_3_OFF (9u)

/** \brief Length for Ifx_CIF_MIEP_IMSC_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_IMSC_WRAP_EP_3_LEN (1u)

